{
  "backend/main.mo": "Empty Motoko actor with no methods or logic.",
  "feature_evidence.json": "Feature evidence report listing UI/UX changes, affected files, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of all frontend source files.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for light/dark modes and applying background/foreground utilities.",
  "frontend/index.html": "Base HTML template loading fonts and mounting the React app root.",
  "frontend/src/App.tsx": "Main React component controlling screen transitions, proposal state, and global effects like music and pointer glow.",
  "frontend/src/components/audio/BackgroundMusic.tsx": "Creates and controls looping romantic background audio with mute support.",
  "frontend/src/components/audio/MuteToggle.tsx": "Floating button to toggle mute state with icons and persistent storage.",
  "frontend/src/components/celebration/ConfettiBurst.tsx": "Canvas animation that emits falling confetti particles from the center.",
  "frontend/src/components/celebration/HeartBurst.tsx": "Canvas animation generating outward‑moving fading hearts in all directions.",
  "frontend/src/components/celebration/HeartPulse.tsx": "CSS-based pulsing heart visual centered on screen.",
  "frontend/src/components/celebration/TypewriterText.tsx": "Typewriter effect component revealing text character-by-character with blinking cursor.",
  "frontend/src/components/effects/PointerGlowTrail.tsx": "Canvas glow‑trail effect following pointer or touch movement with fading particles.",
  "frontend/src/components/proposal/PlayfulChoiceButtons.tsx": "Renders yes/no buttons where the no button moves randomly to avoid clicks and triggers yes action on click.",
  "frontend/src/components/romance/FloatingHeartsBackground.tsx": "Canvas animation generating floating heart shapes that rise with wobble effects across the screen.",
  "frontend/src/components/romance/GlassCard.tsx": "A wrapper component applying a glass-style visual effect to its children.",
  "frontend/src/components/romance/SparklesBackground.tsx": "Canvas-based sparkle animation that spawns fading star-like sparkles across the screen.",
  "frontend/src/constants/valentineCopy.ts": "Stores static Valentine-themed UI text including button labels and celebration messages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, authentication handling, and identity persistence via a React context.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook syncing state with localStorage and updating on key changes.",
  "frontend/src/hooks/useProposalState.ts": "Manages proposal acceptance state using localStorage-backed persistence.",
  "frontend/src/index.css": "Global styles defining fonts, Valentine-themed color variables, glass card styling, and Tailwind layers.",
  "frontend/src/lib/storageKeys.ts": "Defines keys used for storing app state in localStorage.",
  "frontend/src/lib/utils.ts": "Utility function combining class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point initializing React root with query client and Internet Identity provider.",
  "frontend/src/screens/CelebrationScreen.tsx": "Screen with animated romantic effects, typewriter message, virtual hug pulse, and replayable confetti/heart bursts.",
  "frontend/src/screens/LandingScreen.tsx": "Landing screen displaying proposal heading, subtitle, and playful Yes/No interaction within a glass card.",
  "frontend/src/screens/ReturningTransitionScreen.tsx": "Simple transition screen with floating hearts and pulsing/bouncing loading dots using VALENTINE_COPY text.",
  "frontend/tailwind.config.js": "Tailwind config enabling extended colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the romantic SPA, its features, architectural notes, and current state version."
}